import pandas as pd
import os

def main(filepath:str):
    name = ["金融机构代码","内部机构号","客户证件类型","客户证件代码","客户地区代码","存款账户编码","存款协议代码","存款产品类别","存款协议起始日期","存款协议到期日期","币种","存款余额","存款余额折人民币","利率水平","缴存准备金方式"]
    df = pd.read_csv(filepath,delimiter="|",header=None,names=name)
    category ={"D01":"普通存款",
    "D011":"单位活期存款",
    "D012":"单位定期存款",
    "D013":"活期储蓄存款",
    "D014":"定期储蓄存款",
    "D02":"定活两便存款",
    "D03":"通知存款",
    "D04":"协议存款"  ,
    "D05":"协定存款",
    "D051":"结算户存款",
    "D052":"协定户存款",
    "D06":"保证金存款",
    "D061":"银行承兑汇票保证金存款",
    "D062":"信用证保证金存款",
    "D063":"保函保证金存款",
    "D064":"银行本票保证金存款",
    "D065":"信用卡保证金存款",
    "D066":"金融衍生产品交易保证金存款",
    "D067":"黄金交易保证金存款",
    "D068":"证券交易保证金存款",
    "D069":"其他保证金存款",
    "D07":"应解汇款及临时存款",
    "D08":"结构性存款",
    "D09":"信用卡存款",
    "D091":"贷记卡存款",
    "D092":"准贷记卡存款",
    "D10":"财政性存款",
    "D101":"国库存款",
    "D1011":"财政库款",
    "D1012":"财政过渡存款",
    "D109":"其他财政存款",
    "D1091":"划缴财政存款",
    "D1092":"待结算财政款项",
    "D1093":"财政专用基金存款",
    "D1094":"财政预算外存款",
    "D1095":"国库定期存款",
    "D11":"第三方存管存款",
    "D12":"准备金存款",
    "D13":"存放",
    "D14":"特种存款",
    "D15":"委托资金存款（净）",
    "D16":"大额存单",
    "D99":"其他存款"}

    result= df.groupby(["存款产品类别"]).agg({"存款余额":'sum'})
    alies = [category[x] for x in list(result.index)]
    result["存款类别"] = alies
    result["存款余额(万元)"] = round(result["存款余额"]/10000,0)
    result.loc["合计"] = result[["存款余额","存款余额(万元)"]].sum(axis=0)
    _,filename = os.path.split(filepath)
    result.to_csv(f"{filename.replace('.dat','')}.csv")
    print("——————————————————————————————————————")
    print(f"----------{filename}处理结束----------")
    print("______________________________________")

if __name__ == "__main__":
    while 1:
        filepath = input("请拖入文件：")
        main(filepath=filepath)

